In [3]:
import os
os.getcwd()

'C:\\Users\\realn\\PycharmProjects\\ML_training_course'

In [132]:
import pandas as pd

conn_uri = "postgresql://robot-startml-ro:pheiph0hahj1Vaif@postgres.lab.karpov.courses:6432/startml"
df = pd.read_sql(
    """SELECT * FROM "user" LIMIT 10 """,
    conn_uri 
)

df.head()

    id  gender  age country               city  exp_group       os source
0  200       1   34  Russia          Degtyarsk          3  Android    ads
1  201       0   37  Russia             Abakan          0  Android    ads
2  202       1   17  Russia           Smolensk          4  Android    ads
3  203       0   18  Russia             Moscow          1      iOS    ads
4  204       0   36  Russia  Anzhero-Sudzhensk          3  Android    ads

In [137]:
df = pd.read_sql(
    """SELECT * FROM "feed_action" LIMIT 10 """,
    conn_uri 
)

df.head()

   user_id  post_id action                time
0    12924     2297   view 2021-11-18 18:46:48
1   109697     2212   like 2021-11-18 18:46:48
2   130082     2256   like 2021-11-18 18:46:48
3    15165     2308   view 2021-11-18 18:46:48
4   111695     2194   view 2021-11-18 18:46:48

In [148]:
df = pd.read_sql(
    """SELECT * FROM "post" LIMIT 10 """,
    conn_uri 
)

df.head()

   id                                               text     topic
0   1  UK economy facing major risks\n\nThe UK manufa...  business
1   2  Aids and climate top Davos agenda\n\nClimate c...  business
2   3  Asian quake hits European shares\n\nShares in ...  business
3   4  India power shares jump on debut\n\nShares in ...  business
4   5  Lacroix label bought by US firm\n\nLuxury good...  business

In [165]:
df = pd.read_sql(
    """SELECT post_id, COUNT(post_id) as "Likes", MAX(DATE(time)) as "Latest like" FROM "feed_action" as f
        WHERE action = 'like'
        GROUP BY post_id
        ORDER BY count(post_id) DESC
    """,
    conn_uri
)

df

      post_id  Likes Latest like
0        4866  31714  2022-01-01
1        5127  29637  2022-01-05
2        6448  27939  2022-01-22
3        6498  27729  2022-01-22
4        6513  27686  2022-01-22
...       ...    ...         ...
6887      872      1  2021-10-30
6888     4932      1  2021-12-26
6889      267      1  2021-10-22
6890      905      1  2021-10-31
6891      474      1  2021-10-25

[6892 rows x 3 columns]